{
	"description": "get available resources",
	"input_method": "stdin",
	"parameters":{
		"kube_api":{
			   "description": "Kubernetes API endpoint",
			   "type": "String"
		},
		"ca_file":{
			   "description": "Certificate file path",
			   "type": "Optional[String[1]]"
		},
		"token":{
			   "description": "Authentication token obtained from 'kubectl describe secret <secret_name>'",
			   "type": "Optional[String[1]]"
		},
		
		
		
		
		    
			"version":{
			   "description": "version is the preferred version of the resource.  Empty implies the version of the containing resource list For subresources, this may have a different value, for example: v1 (while inside a v1beta1 version of the core resource's group)'.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"name":{
			   "description": "name is the plural name of the resource.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"categories":{
			   "description": "categories is a list of the grouped resources this resource belongs to (e.g. 'all')",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"group":{
			   "description": "group is the preferred group of the resource.  Empty implies the group of the containing resource list. For subresources, this may have a different value, for example: Scale'.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"shortnames":{
			   "description": "shortNames is a list of suggested short names of the resource.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"storageversionhash":{
			   "description": "The hash value of the storage version, the version this resource is converted to when written to the data store. Value must be treated as opaque by clients. Only equality comparison on the value is valid. This is an alpha feature and may change or be removed in the future. The field is populated by the apiserver only if the StorageVersionHash feature gate is enabled. This field will remain optional even if it graduates.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"singularname":{
			   "description": "singularName is the singular name of the resource.  This allows clients to handle plural and singular opaquely. The singularName is more correct for reporting status on a single item and both singular and plural are allowed from the kubectl CLI interface.",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"kind":{
			   "description": "kind is the kind for the resource (e.g. 'Foo' is the kind for a resource 'foo')",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"verbs":{
			   "description": "verbs is a list of supported kube verbs (this includes get, list, watch, create, update, patch, delete, deletecollection, and proxy)",
			   "type": "Optional[String[1]]"
			}
			,
		    
			"namespaced":{
			   "description": "namespaced indicates if a resource is namespaced or not.",
			   "type": "Optional[String[1]]"
			}
			
	}
}